# Dups online
# By Ggend
# V0.2.0
import os
import socket
os.system('cls||clear')
sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
sock.connect(('3.71.250.82', 2222))
try:
	sock.send(bytes.fromhex(input("Вставь в меня очищенный ХендШейк: ")))
	sock.recv(1024)
	print('[√] Отправка порно:Успешно[√]')
except:
	print('[X]\033[1;31m <Неверный ХендШейк,Ты далбоеб?Дюпать научитсь еблан тупорылый> \033[0m1m')
hex = '0000004c0a2431336438633738322d623430362d346261342d396466322d6265393464613063653462631213506c6179657252656d6f7465536572766963651a0f7365744f6e6c696e65537461747573002262792059616b6173616d6922'
sock.send(bytes.fromhex(hex))
print("[√]\033[32m <Накрутка порно:Успешно[√]> \033[0m")
print('''\033[43m <Если что, этот дюп только для клана Ggend.Если ты не в клане пошел нахуй,он сломан, для тебя накрутить только мозги могу.
Часы накручиваются так же, сколько прошло часов в RealLife. 
Не заходи во время дюпа не заходить на аккаунт понял уебан?, и оставить этот скрипт работать в фоновом режиме, не удаляя его со вкладок. Можете просто оставлять его на ночь.
Также нужно обновлять хендшейк каждые 17 часов.Если хочешь что бы скрипт пахал обнови 
Автор этого скрипта: Ggend
Канал автора: t.me/PrivteDar> 
Перевел: Гей сука\033[0m''')
while 1:
	hex = '0000004c0a2431336438633738322d623430362d346261342d396466322d6265393464613063653462631213506c6179657252656d6f7465536572766963651a0f7365744f6e6c696e65537461747573002262792059616b6173616d6922'
	sock.send(bytes.fromhex(hex))
